Revit 2026 API

# BalusterInfo Methods

---

The BalusterInfo type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetReferenceNameForHost | Gets the name string to be used as a reference to Host in the current language. |
|  | GetReferenceNameForTopRail | Gets the name string to be used as a reference to Top Rail in the current language. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

BalusterInfo Class

Autodesk.Revit.DB.Architecture Namespace